
Функция SendAchievementsSendAchievements(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
//Создаем новую переменную для расшифровки
//полученных данных из мобильного приложения
ЧтениеJSON = Новый ЧтениеJSON();
//Устанавливаем текст, который хотим расшифровать
//Мы его отправляем в параметре "SendAchievements"
ЧтениеJSON.УстановитьСтроку(Запрос.ПараметрыЗапроса.Получить("SendAchievements"));
//Записываем в переменную "Достижения" расшифрованные данные
Достижение = ПрочитатьJSON(ЧтениеJSON);
//Закрываем чтение, так как оно нам больше не нужно
ЧтениеJSON.Закрыть();
//Начинаем записывать достижения в справочник
//Создаем новый элемент в справочнике
НовоеДостижение = Справочники.Достижения.СоздатьЭлемент();
//Заполняем поля наименование, пользователь и количество ворон
НовоеДостижение.Наименование = Достижение.Наименование;
НовоеДостижение.Пользователь = Достижение.Пользователь;
НовоеДостижение.КоличествоВорон = Достижение.КоличествоМанулов;
//Записываем достижение
НовоеДостижение.Записать();
//Возвращаем строку "Данные записаны" HTTP-сервису
Ответ.УстановитьТелоИзСтроки("Данные записаны", КодировкаТекста.ANSI);
Возврат Ответ; 
КонецФункции
