
&НаКлиенте
Процедура СчитатьМанулов(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаПодсчётаМанулов"); 
КонецПроцедуры

&НаКлиенте
Процедура Поздороваться(Команда)
	Имя = "";
ЗаголовокВопроса = "Введите имя";
Если ВвестиСтроку(Имя, ЗаголовокВопроса, 0, Истина) Тогда
ЗапомнитьИмя(Имя);
КонецЕсли; 
КонецПроцедуры 

&НаСервере
Процедура ЗапомнитьИмя(Имя)
ПараметрыСеанса. ТекущийПользователь = Имя;
Приветствие = "Привет, " + Имя;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Приветствие = "Привет";
КонецПроцедуры
